# Parameter Type Id Wall Sweep Return Angle Property

Source: https://www.revitapidocs.com/2026/e0274dfd-5a1d-7bf9-eab8-8160f18c706b.htm

---

| Parameter Type Id Wall Sweep Return Angle Property |
| --- |

"Return Angle"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId WallSweepReturnAngle { get; }
```

```
Public Shared ReadOnly Property WallSweepReturnAngle As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ WallSweepReturnAngle {
	ForgeTypeId^ get ();
}
```

```
static member WallSweepReturnAngle : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace